Revit 2024 API
RebarCoverType Class
 A named value for a clear cover distance.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class RebarCoverType : ElementType
Visual Basic
Public Class RebarCoverType _
	Inherits ElementType
Visual C++
public ref class RebarCoverType : public ElementType
Remarks
 In Revit Structure, CoverTypes are the rows in the Rebar Cover Settings dialog.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.Structure.RebarCoverType
See Also
RebarCoverType Members
Autodesk.Revit.DB.Structure Namespace